{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# RAG demo level 2\n",
    "In more advanced demonstration we will add hierarchical and graph approaches by extracting metadata, finding and storing relationships between documents and adding summarizations for aggregate questions.\n",
    "\n",
    "## Step 2 - Storing graph in PostgreSQL using AGE extension"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using postgresql://psqladmin:)ycxlsxlLRKks*g#@psql-graphrag-psbv.postgres.database.azure.com/demo?sslmode=require as the database connection string\n",
      "Using https://graphrag-psbv.openai.azure.com/ as the embedding model endpoint\n",
      "Using https://graphrag-psbv.openai.azure.com/ as the gpt-4o-mini model endpoint\n",
      "Using https://graphrag-psbv.openai.azure.com/ as the gpt-4o model endpoint\n"
     ]
    }
   ],
   "source": [
    "import subprocess\n",
    "import os\n",
    "import json\n",
    "\n",
    "original_dir = os.getcwd()\n",
    "try:\n",
    "    # Jump into the terraform directory\n",
    "    os.chdir('terraform')\n",
    "\n",
    "    # Get the database connection string\n",
    "    PGHOST = subprocess.run(['terraform', 'output', '-raw', 'PGHOST'], stdout=subprocess.PIPE).stdout.decode('utf-8')\n",
    "    PGDATABASE = subprocess.run(['terraform', 'output', '-raw', 'PGDATABASE'], stdout=subprocess.PIPE).stdout.decode('utf-8')\n",
    "    PGUSER = subprocess.run(['terraform', 'output', '-raw', 'PGUSER'], stdout=subprocess.PIPE).stdout.decode('utf-8')\n",
    "    PGPASSWORD = subprocess.run(['terraform', 'output', '-raw', 'PGPASSWORD'], stdout=subprocess.PIPE).stdout.decode('utf-8')\n",
    "    db_uri = f\"postgresql://{PGUSER}:{PGPASSWORD}@{PGHOST}/{PGDATABASE}?sslmode=require\"\n",
    "\n",
    "    # Get the embedding model endpoint and key\n",
    "    model_configurations = subprocess.run(['terraform', 'output', '-raw', 'model_configurations'], stdout=subprocess.PIPE).stdout.decode('utf-8')\n",
    "    model_config = json.loads(model_configurations)\n",
    "    embedding_model = model_config[\"models\"][\"text-embedding-3-large\"]\n",
    "    EMBEDDINGS_ENDPOINT = embedding_model[\"endpoint\"]\n",
    "    EMBEDDINGS_KEY = embedding_model[\"key\"]\n",
    "    gpt_4o_mini_model = model_config[\"models\"][\"gpt-4o-mini\"]\n",
    "    GPT_4O_MINI_ENDPOINT = gpt_4o_mini_model[\"endpoint\"]\n",
    "    GPT_4O_MINI_KEY = gpt_4o_mini_model[\"key\"]\n",
    "    gpt_4o_model = model_config[\"models\"][\"gpt-4o\"]\n",
    "    GPT_4O_ENDPOINT = gpt_4o_model[\"endpoint\"]\n",
    "    GPT_4O_KEY = gpt_4o_model[\"key\"]\n",
    "\n",
    "    print(f\"Using {db_uri} as the database connection string\")\n",
    "    print(f\"Using {EMBEDDINGS_ENDPOINT} as the embedding model endpoint\")\n",
    "    print(f\"Using {GPT_4O_MINI_ENDPOINT} as the gpt-4o-mini model endpoint\")\n",
    "    print(f\"Using {GPT_4O_ENDPOINT} as the gpt-4o model endpoint\")\n",
    "\n",
    "finally:\n",
    "    os.chdir(original_dir)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create clients for PostgreSQL and OpenAI models"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "import psycopg2\n",
    "from psycopg2 import sql\n",
    "from openai import AzureOpenAI \n",
    "import pandas as pd\n",
    "import age\n",
    "\n",
    "conn = psycopg2.connect(db_uri)\n",
    "\n",
    "gpt_4o_client = AzureOpenAI(  \n",
    "    azure_endpoint=GPT_4O_ENDPOINT,  \n",
    "    api_key=GPT_4O_KEY,  \n",
    "    api_version=\"2024-05-01-preview\",\n",
    ")\n",
    "\n",
    "gpt_4o_mini_client = AzureOpenAI(\n",
    "    azure_endpoint=GPT_4O_MINI_ENDPOINT,  \n",
    "    api_key=GPT_4O_MINI_KEY,  \n",
    "    api_version=\"2024-05-01-preview\",\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Install and configure extensions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List extensions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>oid</th>\n",
       "      <th>extname</th>\n",
       "      <th>extowner</th>\n",
       "      <th>extnamespace</th>\n",
       "      <th>extrelocatable</th>\n",
       "      <th>extversion</th>\n",
       "      <th>extconfig</th>\n",
       "      <th>extcondition</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>14258</td>\n",
       "      <td>plpgsql</td>\n",
       "      <td>10</td>\n",
       "      <td>11</td>\n",
       "      <td>False</td>\n",
       "      <td>1.0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>24762</td>\n",
       "      <td>vector</td>\n",
       "      <td>10</td>\n",
       "      <td>2200</td>\n",
       "      <td>True</td>\n",
       "      <td>0.7.0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>25082</td>\n",
       "      <td>pg_diskann</td>\n",
       "      <td>10</td>\n",
       "      <td>2200</td>\n",
       "      <td>False</td>\n",
       "      <td>0.4.0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>25102</td>\n",
       "      <td>azure_ai</td>\n",
       "      <td>10</td>\n",
       "      <td>11</td>\n",
       "      <td>False</td>\n",
       "      <td>1.1.0</td>\n",
       "      <td>None</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>25184</td>\n",
       "      <td>age</td>\n",
       "      <td>10</td>\n",
       "      <td>25183</td>\n",
       "      <td>False</td>\n",
       "      <td>1.5.0</td>\n",
       "      <td>[25185, 25197]</td>\n",
       "      <td>[, ]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     oid     extname  extowner  extnamespace  extrelocatable extversion  \\\n",
       "0  14258     plpgsql        10            11           False        1.0   \n",
       "1  24762      vector        10          2200            True      0.7.0   \n",
       "2  25082  pg_diskann        10          2200           False      0.4.0   \n",
       "3  25102    azure_ai        10            11           False      1.1.0   \n",
       "4  25184         age        10         25183           False      1.5.0   \n",
       "\n",
       "        extconfig extcondition  \n",
       "0            None         None  \n",
       "1            None         None  \n",
       "2            None         None  \n",
       "3            None         None  \n",
       "4  [25185, 25197]         [, ]  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "command = \"\"\"\n",
    "SELECT * FROM pg_extension;\n",
    "\"\"\"\n",
    "\n",
    "with conn.cursor() as cursor:\n",
    "    cursor.execute(command)\n",
    "    result = cursor.fetchall()\n",
    "    columns = [desc[0] for desc in cursor.description]\n",
    "\n",
    "pd.DataFrame(result, columns=columns)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "command = \"\"\"\n",
    "CREATE EXTENSION IF NOT EXISTS vector;\n",
    "CREATE EXTENSION IF NOT EXISTS pg_diskann CASCADE;\n",
    "CREATE EXTENSION IF NOT EXISTS azure_ai;\n",
    "CREATE EXTENSION IF NOT EXISTS age CASCADE;\n",
    "\"\"\"\n",
    "\n",
    "try:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute(command)\n",
    "        conn.commit()\n",
    "except psycopg2.Error as e:\n",
    "    print(f\"Error: {e}\")\n",
    "    conn.rollback()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "command = f\"\"\"\n",
    "select azure_ai.set_setting('azure_openai.endpoint','{EMBEDDINGS_ENDPOINT}'); \n",
    "select azure_ai.set_setting('azure_openai.subscription_key', '{EMBEDDINGS_KEY}'); \n",
    "\"\"\"\n",
    "\n",
    "try:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute(command)\n",
    "        conn.commit()\n",
    "except psycopg2.Error as e:\n",
    "    print(f\"Error: {e}\")\n",
    "    conn.rollback()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Enable AGE for this connection\n",
    "\n",
    "command = \"\"\"\n",
    "SET search_path = ag_catalog, \"$user\", public;\n",
    "\"\"\"\n",
    "\n",
    "try:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute(command)\n",
    "        conn.commit()\n",
    "except psycopg2.Error as e:\n",
    "    print(f\"Error: {e}\")\n",
    "    conn.rollback()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Load from file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded 8551 movies\n"
     ]
    }
   ],
   "source": [
    "movies_df = pd.read_json(\"data/movies_graph.json\", orient=\"records\")\n",
    "print(f\"Loaded {len(movies_df)} movies\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create movies graph\n",
    "\n",
    "command = \"\"\"\n",
    "SELECT create_graph('movies_graph');\n",
    "\"\"\"\n",
    "\n",
    "try:\n",
    "    with conn.cursor() as cursor:\n",
    "        cursor.execute(command)\n",
    "        conn.commit()\n",
    "except psycopg2.Error as e:\n",
    "    print(f\"Error: {e}\")\n",
    "    conn.rollback()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inserted 1/8551 movies\n",
      "Inserted 501/8551 movies\n",
      "Inserted 1001/8551 movies\n",
      "Inserted 1501/8551 movies\n",
      "Inserted 2001/8551 movies\n",
      "Inserted 2501/8551 movies\n",
      "Inserted 3001/8551 movies\n",
      "Inserted 3501/8551 movies\n",
      "Inserted 4001/8551 movies\n",
      "Inserted 4501/8551 movies\n",
      "Inserted 5001/8551 movies\n",
      "Inserted 5501/8551 movies\n",
      "Inserted 6001/8551 movies\n",
      "Inserted 6501/8551 movies\n",
      "Inserted 7001/8551 movies\n",
      "Inserted 7501/8551 movies\n",
      "Inserted 8001/8551 movies\n",
      "Inserted 8501/8551 movies\n"
     ]
    }
   ],
   "source": [
    "for idx, row in movies_df.iterrows():\n",
    "    movie_id = str(row['id'])\n",
    "    movie_title = str(row['title']).replace(\"'\", \"\\\\'\") if row['title'] is not None else \"\"\n",
    "    movie_overview = str(row['overview']).replace(\"'\", \"\\\\'\") if row['overview'] is not None else \"\"\n",
    "    movie_combined_text = f\"TITLE: {movie_title} OVERVIEW: {movie_overview}\"\n",
    "\n",
    "    command = f\"\"\"\n",
    "    SELECT * FROM cypher('movies_graph', $$\n",
    "        MERGE (m:Movie {{id: '{movie_id}'}})\n",
    "        SET m.title = '{movie_title}',\n",
    "            m.overview = '{movie_overview}',\n",
    "            m.combined_text = '{movie_combined_text}'\n",
    "        RETURN m\n",
    "    $$) as (m agtype);\n",
    "    \"\"\"\n",
    "\n",
    "    try:\n",
    "        with conn.cursor() as cursor:\n",
    "            cursor.execute(command)\n",
    "            conn.commit()\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "        conn.rollback()\n",
    "\n",
    "    if idx % 500 == 0:\n",
    "        print(f\"Inserted {idx+1}/{len(movies_df)} movies\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Insert traits (metadata, communities) into graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Processing movies 1 to 200 out of 8551\n",
      "Finished batch: movies 1 to 200\n",
      "Processing movies 201 to 400 out of 8551\n",
      "Finished batch: movies 201 to 400\n",
      "Processing movies 401 to 600 out of 8551\n",
      "Finished batch: movies 401 to 600\n",
      "Processing movies 601 to 800 out of 8551\n",
      "Finished batch: movies 601 to 800\n",
      "Processing movies 801 to 1000 out of 8551\n",
      "Finished batch: movies 801 to 1000\n",
      "Processing movies 1001 to 1200 out of 8551\n",
      "Finished batch: movies 1001 to 1200\n",
      "Processing movies 1201 to 1400 out of 8551\n",
      "Finished batch: movies 1201 to 1400\n",
      "Processing movies 1401 to 1600 out of 8551\n",
      "Finished batch: movies 1401 to 1600\n",
      "Processing movies 1601 to 1800 out of 8551\n",
      "Finished batch: movies 1601 to 1800\n",
      "Processing movies 1801 to 2000 out of 8551\n",
      "Finished batch: movies 1801 to 2000\n",
      "Processing movies 2001 to 2200 out of 8551\n",
      "Finished batch: movies 2001 to 2200\n",
      "Processing movies 2201 to 2400 out of 8551\n",
      "Finished batch: movies 2201 to 2400\n",
      "Processing movies 2401 to 2600 out of 8551\n",
      "Finished batch: movies 2401 to 2600\n",
      "Processing movies 2601 to 2800 out of 8551\n",
      "Finished batch: movies 2601 to 2800\n",
      "Processing movies 2801 to 3000 out of 8551\n",
      "Finished batch: movies 2801 to 3000\n",
      "Processing movies 3001 to 3200 out of 8551\n",
      "Finished batch: movies 3001 to 3200\n",
      "Processing movies 3201 to 3400 out of 8551\n",
      "Finished batch: movies 3201 to 3400\n",
      "Processing movies 3401 to 3600 out of 8551\n",
      "Finished batch: movies 3401 to 3600\n",
      "Processing movies 3601 to 3800 out of 8551\n",
      "Finished batch: movies 3601 to 3800\n",
      "Processing movies 3801 to 4000 out of 8551\n",
      "Finished batch: movies 3801 to 4000\n",
      "Processing movies 4001 to 4200 out of 8551\n",
      "Finished batch: movies 4001 to 4200\n",
      "Processing movies 4201 to 4400 out of 8551\n",
      "Finished batch: movies 4201 to 4400\n",
      "Processing movies 4401 to 4600 out of 8551\n",
      "Finished batch: movies 4401 to 4600\n",
      "Processing movies 4601 to 4800 out of 8551\n",
      "Finished batch: movies 4601 to 4800\n",
      "Processing movies 4801 to 5000 out of 8551\n",
      "Finished batch: movies 4801 to 5000\n",
      "Processing movies 5001 to 5200 out of 8551\n",
      "Finished batch: movies 5001 to 5200\n",
      "Processing movies 5201 to 5400 out of 8551\n",
      "Finished batch: movies 5201 to 5400\n",
      "Processing movies 5401 to 5600 out of 8551\n",
      "Finished batch: movies 5401 to 5600\n",
      "Processing movies 5601 to 5800 out of 8551\n",
      "Finished batch: movies 5601 to 5800\n",
      "Processing movies 5801 to 6000 out of 8551\n",
      "Finished batch: movies 5801 to 6000\n",
      "Processing movies 6001 to 6200 out of 8551\n",
      "Finished batch: movies 6001 to 6200\n",
      "Processing movies 6201 to 6400 out of 8551\n",
      "Finished batch: movies 6201 to 6400\n",
      "Processing movies 6401 to 6600 out of 8551\n",
      "Finished batch: movies 6401 to 6600\n",
      "Processing movies 6601 to 6800 out of 8551\n",
      "Finished batch: movies 6601 to 6800\n",
      "Processing movies 6801 to 7000 out of 8551\n",
      "Finished batch: movies 6801 to 7000\n",
      "Processing movies 7001 to 7200 out of 8551\n",
      "Finished batch: movies 7001 to 7200\n",
      "Processing movies 7201 to 7400 out of 8551\n",
      "Finished batch: movies 7201 to 7400\n",
      "Processing movies 7401 to 7600 out of 8551\n",
      "Finished batch: movies 7401 to 7600\n",
      "Processing movies 7601 to 7800 out of 8551\n",
      "Finished batch: movies 7601 to 7800\n",
      "Processing movies 7801 to 8000 out of 8551\n",
      "Finished batch: movies 7801 to 8000\n",
      "Processing movies 8001 to 8200 out of 8551\n",
      "Finished batch: movies 8001 to 8200\n",
      "Processing movies 8201 to 8400 out of 8551\n",
      "Finished batch: movies 8201 to 8400\n",
      "Processing movies 8401 to 8551 out of 8551\n",
      "Finished batch: movies 8401 to 8551\n"
     ]
    }
   ],
   "source": [
    "traits = {\n",
    "    \"genres\": (\"Genre\", \"IN_GENRE\"),\n",
    "    \"characters\": (\"Character\", \"FEATURES_CHARACTER\"),\n",
    "    \"themes\": (\"Theme\", \"INCLUDES_THEME\"),\n",
    "    \"setting\": (\"Setting\", \"SET_IN\"),\n",
    "    \"series\": (\"Series\", \"PART_OF_SERIES\"),\n",
    "}\n",
    "\n",
    "batch_size = 200\n",
    "resume_index = 0 \n",
    "\n",
    "total_rows = len(movies_df)\n",
    "\n",
    "for batch_start in range(resume_index, total_rows, batch_size):\n",
    "    batch_end = min(batch_start + batch_size, total_rows)\n",
    "    batch_df = movies_df.iloc[batch_start:batch_end]\n",
    "    print(f\"Processing movies {batch_start + 1} to {batch_end} out of {total_rows}\")\n",
    "\n",
    "    for idx, row in batch_df.iterrows():\n",
    "        movie_id = str(row['id'])\n",
    "        for trait_attr, (node_label, rel_type) in traits.items():\n",
    "            trait_values = row.get(trait_attr)\n",
    "            if not trait_values:\n",
    "                continue\n",
    "            for trait in trait_values:\n",
    "                safe_trait = str(trait).replace(\"'\", \"\\\\'\")\n",
    "                cypher_query = f\"\"\"\n",
    "                SELECT * FROM cypher('movies_graph', $$\n",
    "                    MERGE (g:{node_label} {{name: '{safe_trait}'}})\n",
    "                    WITH g\n",
    "                    MATCH (m:Movie {{id: '{movie_id}'}})\n",
    "                    MERGE (m)-[:{rel_type}]->(g)\n",
    "                    RETURN m, g$$) as (m agtype, g agtype);\n",
    "                \"\"\"\n",
    "                try:\n",
    "                    with conn.cursor() as cursor:\n",
    "                        cursor.execute(cypher_query)\n",
    "                        conn.commit()\n",
    "                except Exception as e:\n",
    "                    print(f\"{idx} -> Error processing movie id {movie_id} for {trait_attr} '{trait}': {e}\")\n",
    "                    conn.rollback()\n",
    "    print(f\"Finished batch: movies {batch_start + 1} to {batch_end}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Test graph queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get genres"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Neo-Noir</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Parody</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Slasher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Neo-noir</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>History</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>148</th>\n",
       "      <td>Faith</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>149</th>\n",
       "      <td>Apocalyptic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>Police</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>151</th>\n",
       "      <td>Period Film</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>152</th>\n",
       "      <td>Mecha</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>153 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            name\n",
       "0       Neo-Noir\n",
       "1         Parody\n",
       "2        Slasher\n",
       "3       Neo-noir\n",
       "4        History\n",
       "..           ...\n",
       "148        Faith\n",
       "149  Apocalyptic\n",
       "150       Police\n",
       "151  Period Film\n",
       "152        Mecha\n",
       "\n",
       "[153 rows x 1 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "command = \"\"\"\n",
    "SELECT * FROM cypher('movies_graph', $$\n",
    "MATCH (g:Genre)\n",
    "RETURN DISTINCT g.name as name$$) as (name text);\n",
    "\"\"\"\n",
    "\n",
    "with conn.cursor() as cursor:\n",
    "    cursor.execute(command)\n",
    "    result = cursor.fetchall()\n",
    "    columns = [desc[0] for desc in cursor.description]\n",
    "\n",
    "pd.DataFrame(result, columns=columns)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get settings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Professional Rivalry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>adolescence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>infidelity</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Love overcoming adversity</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Slasher</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3498</th>\n",
       "      <td>love</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3499</th>\n",
       "      <td>Power and Transformation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3500</th>\n",
       "      <td>Alliance against a common enemy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3501</th>\n",
       "      <td>Environmental Conservation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3502</th>\n",
       "      <td>Historical Fiction</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3503 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 name\n",
       "0                Professional Rivalry\n",
       "1                         adolescence\n",
       "2                          infidelity\n",
       "3           Love overcoming adversity\n",
       "4                             Slasher\n",
       "...                               ...\n",
       "3498                             love\n",
       "3499         Power and Transformation\n",
       "3500  Alliance against a common enemy\n",
       "3501       Environmental Conservation\n",
       "3502               Historical Fiction\n",
       "\n",
       "[3503 rows x 1 columns]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "command = \"\"\"\n",
    "SELECT * FROM cypher('movies_graph', $$\n",
    "MATCH (g:Theme)\n",
    "RETURN DISTINCT g.name as name$$) as (name text);\n",
    "\"\"\"\n",
    "\n",
    "with conn.cursor() as cursor:\n",
    "    cursor.execute(command)\n",
    "    result = cursor.fetchall()\n",
    "    columns = [desc[0] for desc in cursor.description]\n",
    "\n",
    "pd.DataFrame(result, columns=columns)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "theme = \"love\"\n",
    "genre = \"Slasher\"\n",
    "\n",
    "# command = f\"\"\"\n",
    "# SELECT * FROM cypher('movies_graph', $$\n",
    "#     MATCH (m:Movie)-[:IN_GENRE]->(g:Genre),\n",
    "#           (m)-[:INCLUDES_THEME]->(t:Theme)\n",
    "#     WHERE g.name = '{genre}' AND t.name = '{theme}'\n",
    "#     RETURN m\n",
    "# $$) as (m agtype);\n",
    "# \"\"\"\n",
    "\n",
    "command = f\"\"\"\n",
    "SELECT * FROM cypher('movies_graph', $$\n",
    "    MATCH (m:Movie)-[:IN_GENRE]->(g:Genre),\n",
    "          (m)-[:INCLUDES_THEME]->(t:Theme)\n",
    "    WHERE t.name = '{theme}'\n",
    "    RETURN m\n",
    "$$) as (m agtype);\n",
    "\"\"\"\n",
    "\n",
    "def parse_agtype(s):\n",
    "    s = s.strip()\n",
    "    if s.endswith(\"::vertex\"):\n",
    "        s = s.rsplit(\"::\", 1)[0]\n",
    "    return json.loads(s)\n",
    "\n",
    "with conn.cursor() as cursor:\n",
    "    cursor.execute(command)\n",
    "    result = cursor.fetchall()\n",
    "    columns = [desc[0] for desc in cursor.description]\n",
    "\n",
    "df = pd.DataFrame(result, columns=columns)\n",
    "\n",
    "properties = df['m'].apply(lambda x: parse_agtype(x)['properties'] if isinstance(x, str) else x)\n",
    "properties_df = pd.json_normalize(properties)\n",
    "\n",
    "properties_df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Clean up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Create movies graph\n",
    "\n",
    "# command = \"\"\"\n",
    "# SELECT drop_graph('movies_graph', true);\n",
    "# \"\"\"\n",
    "\n",
    "# try:\n",
    "#     with conn.cursor() as cursor:\n",
    "#         cursor.execute(command)\n",
    "#         conn.commit()\n",
    "# except psycopg2.Error as e:\n",
    "#     print(f\"Error: {e}\")\n",
    "#     conn.rollback()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
